
"""
Реалізуйте алгоритм сортування обміном (бульбашкове сортування).
"""

N = 5000     # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for j in range(n, 0, -1):
        for i in range(1, j):
            if array[i-1] > array[i]:
                array[i-1], array[i] = array[i], array[i-1]

        #print(array)



if __name__ == "__main__":
    array = [-3, 4, 5, -7, 21, 8, 10, 20, 13]
    print(array)
    sort(array)